       IDENTIFICATION DIVISION.
       PROGRAM-ID. day1.
       AUTHOR. jphNovitz.
       DATE-WRITTEN. 12/09/2025.
       PROCEDURE DIVISION.
           display "Hello world".
           STOP RUN.
